maintainPendingInvoice-eB2_2-Sample.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns="urn:schemas-qad-com:xml-services"
  xmlns:qcom="urn:schemas-qad-com:xml-services:common"
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <soapenv:Header>
    <wsa:Action/>
    <wsa:To>urn:services-qad-com:devldb</wsa:To>
    <wsa:MessageID>urn:services-qad-com::devldb</wsa:MessageID>
    <wsa:ReferenceParameters>
      <qcom:suppressResponseDetail>true</qcom:suppressResponseDetail>
    </wsa:ReferenceParameters>
    <wsa:ReplyTo>
      <wsa:Address>urn:services-qad-com:</wsa:Address>
    </wsa:ReplyTo>
  </soapenv:Header>
  <soapenv:Body>
    <maintainPendingInvoice>
      <qcom:dsSessionContext>
        <qcom:ttContext>
          <qcom:propertyQualifier>QAD</qcom:propertyQualifier>
          <qcom:propertyName>domain</qcom:propertyName>
          <qcom:propertyValue/>
        </qcom:ttContext>
        <qcom:ttContext>
          <qcom:propertyQualifier>QAD</qcom:propertyQualifier>
          <qcom:propertyName>scopeTransaction</qcom:propertyName>
          <qcom:propertyValue>false</qcom:propertyValue>
        </qcom:ttContext>
        <qcom:ttContext>
          <qcom:propertyQualifier>QAD</qcom:propertyQualifier>
          <qcom:propertyName>version</qcom:propertyName>
          <qcom:propertyValue>eB2_2</qcom:propertyValue>
        </qcom:ttContext>
        <qcom:ttContext>
          <qcom:propertyQualifier>QAD</qcom:propertyQualifier>
          <qcom:propertyName>mnemonicsRaw</qcom:propertyName>
          <qcom:propertyValue>false</qcom:propertyValue>
        </qcom:ttContext>
        <!--
        <qcom:ttContext>
          <qcom:propertyQualifier>QAD</qcom:propertyQualifier>
          <qcom:propertyName>username</qcom:propertyName>
          <qcom:propertyValue/>
        </qcom:ttContext>
        <qcom:ttContext>
          <qcom:propertyQualifier>QAD</qcom:propertyQualifier>
          <qcom:propertyName>password</qcom:propertyName>
          <qcom:propertyValue/>
        </qcom:ttContext>
        -->
        <qcom:ttContext>
          <qcom:propertyQualifier>QAD</qcom:propertyQualifier>
          <qcom:propertyName>action</qcom:propertyName>
          <qcom:propertyValue/>
        </qcom:ttContext>
        <qcom:ttContext>
          <qcom:propertyQualifier>QAD</qcom:propertyQualifier>
          <qcom:propertyName>entity</qcom:propertyName>
          <qcom:propertyValue/>
        </qcom:ttContext>
        <qcom:ttContext>
          <qcom:propertyQualifier>QAD</qcom:propertyQualifier>
          <qcom:propertyName>email</qcom:propertyName>
          <qcom:propertyValue/>
        </qcom:ttContext>
        <qcom:ttContext>
          <qcom:propertyQualifier>QAD</qcom:propertyQualifier>
          <qcom:propertyName>emailLevel</qcom:propertyName>
          <qcom:propertyValue/>
        </qcom:ttContext>
      </qcom:dsSessionContext>
      <dsPendingInvoice>
        <pendingInvoice>
          <operation>text</operation>
          <soNbr>text</soNbr>
          <soCust>text</soCust>
          <soBill>text</soBill>
          <soShip>text</soShip>
          <yn>true</yn>
          <adName>text</adName>
          <adLine1>text</adLine1>
          <adLine2>text</adLine2>
          <adLine3>text</adLine3>
          <adCity>text</adCity>
          <adState>text</adState>
          <adZip>text</adZip>
          <adFormat>999</adFormat>
          <adCtry>text</adCtry>
          <adCounty>text</adCounty>
          <adSort>text</adSort>
          <adTaxable>true</adTaxable>
          <adTaxZone>text</adTaxZone>
          <adTaxc>text</adTaxc>
          <adTaxUsage>text</adTaxUsage>
          <adTaxIn>true</adTaxIn>
          <adGstId>text</adGstId>
          <adPstId>text</adPstId>
          <adMisc1Id>text</adMisc1Id>
          <adMisc2Id>text</adMisc2Id>
          <adMisc3Id>text</adMisc3Id>
          <adTxInCity>true</adTxInCity>
          <lEdittax>true</lEdittax>
          <soOrdDate>2003-01-31</soOrdDate>
          <soReqDate>2003-01-31</soReqDate>
          <soDueDate>2003-01-31</soDueDate>
          <performDate>2003-01-31</performDate>
          <soPricingDt>2003-01-31</soPricingDt>
          <soPo>text</soPo>
          <soRmks>text</soRmks>
          <linePricing>true</linePricing>
          <soPrList>text</soPrList>
          <soSite>text</soSite>
          <soChannel>text</soChannel>
          <soProject>text</soProject>
          <soShipDate>2003-01-31</soShipDate>
          <soCurr>text</soCurr>
          <soLang>text</soLang>
          <soTaxable>true</soTaxable>
          <soTaxc>text</soTaxc>
          <soTaxDate>2003-01-31</soTaxDate>
          <soFixPr>true</soFixPr>
          <soCrTerms>text</soCrTerms>
          <socrtInt>999.99</socrtInt>
          <vRate>999.99</vRate>
          <vRate2>999.99</vRate2>
          <ioFixRate>true</ioFixRate>
          <reprice>true</reprice>
          <taxUsage>text</taxUsage>
          <taxEnv>text</taxEnv>
          <taxClass>text</taxClass>
          <taxTaxable>true</taxTaxable>
          <taxIn>true</taxIn>
          <soSlspsn>text</soSlspsn>
          <multSlspsn>true</multSlspsn>
          <shipmentId>text</shipmentId>
          <soCommPct>999.99</soCommPct>
          <soShipvia>text</soShipvia>
          <soBol>text</soBol>
          <soFrList>text</soFrList>
          <soFrMinWt>999.99</soFrMinWt>
          <soFrTerms>text</soFrTerms>
          <calcFr>true</calcFr>
          <dispFr>true</dispFr>
          <impexp>true</impexp>
          <socmmts>true</socmmts>
          <lUpComm>true</lUpComm>
          <soSlspsn1>text</soSlspsn1>
          <soSlspsn1>text</soSlspsn1>
          <soSlspsn1>text</soSlspsn1>
          <soSlspsn1>text</soSlspsn1>
          <soCommPct1>999.99</soCommPct1>
          <soCommPct1>999.99</soCommPct1>
          <soCommPct1>999.99</soCommPct1>
          <soCommPct1>999.99</soCommPct1>
          <ieTermsDeliv>text</ieTermsDeliv>
          <ieNatTrans>text</ieNatTrans>
          <ieCtryDesdisp>text</ieCtryDesdisp>
          <ieModeTransp>text</ieModeTransp>
          <iePortArrdisp>text</iePortArrdisp>
          <ieStatProc>text</ieStatProc>
          <iePortTransh>text</iePortTransh>
          <ieInclMemo>true</ieInclMemo>
          <soDiscPct>999.99</soDiscPct>
          <soTrl1Cd>text</soTrl1Cd>
          <soTrl1Amt>999.99</soTrl1Amt>
          <soTrl2Cd>text</soTrl2Cd>
          <soTrl2Amt>999.99</soTrl2Amt>
          <soTrl3Cd>text</soTrl3Cd>
          <soTrl3Amt>999.99</soTrl3Amt>
          <taxEdit>true</taxEdit>
          <soCrInit>text</soCrInit>
          <soCrCard>text</soCrCard>
          <soStat>text</soStat>
          <soRev>999</soRev>
          <soFob>text</soFob>
          <soInvNbr>text</soInvNbr>
          <soToInv>true</soToInv>
          <soInvoiced>true</soInvoiced>
          <soPrepaid>999.99</soPrepaid>
          <soArAcct>text</soArAcct>
          <soArSub>text</soArSub>
          <soArCc>text</soArCc>
          <soPrintSo>true</soPrintSo>
          <soPrintPl>true</soPrintPl>
          <impexpEdit>true</impexpEdit>
          <pendingInvoiceTransComment>
            <operation>text</operation>
            <cmtSeq>999</cmtSeq>
            <cdRef>text</cdRef>
            <cdType>text</cdType>
            <cdLang>text</cdLang>
            <cdSeq>999</cdSeq>
            <cmtCmmt>text</cmtCmmt>
            <cmtCmmt>text</cmtCmmt>
            <cmtCmmt>text</cmtCmmt>
            <cmtCmmt>text</cmtCmmt>
            <cmtCmmt>text</cmtCmmt>
            <cmtCmmt>text</cmtCmmt>
            <cmtCmmt>text</cmtCmmt>
            <cmtCmmt>text</cmtCmmt>
            <cmtCmmt>text</cmtCmmt>
            <cmtCmmt>text</cmtCmmt>
            <cmtCmmt>text</cmtCmmt>
            <cmtCmmt>text</cmtCmmt>
            <cmtCmmt>text</cmtCmmt>
            <cmtCmmt>text</cmtCmmt>
            <cmtCmmt>text</cmtCmmt>
            <prtOnQuote>true</prtOnQuote>
            <prtOnSo>true</prtOnSo>
            <prtOnInvoice>true</prtOnInvoice>
            <prtOnPacklist>true</prtOnPacklist>
            <prtOnPo>true</prtOnPo>
            <prtOnRct>true</prtOnRct>
            <prtOnRtv>true</prtOnRtv>
            <prtOnShpr>true</prtOnShpr>
            <prtOnBol>true</prtOnBol>
            <prtOnCus>true</prtOnCus>
            <prtOnProb>true</prtOnProb>
            <prtOnSchedule>true</prtOnSchedule>
            <prtOnIsrqst>true</prtOnIsrqst>
            <prtOnDo>true</prtOnDo>
            <prtOnIntern>true</prtOnIntern>
          </pendingInvoiceTransComment>
          <salesLine>
            <operation>text</operation>
            <line>999</line>
            <sodPart>text</sodPart>
            <sodSite>text</sodSite>
            <sodQtyChg>999.99</sodQtyChg>
            <sodUm>text</sodUm>
            <repriceDtl>true</repriceDtl>
            <sodBoChg>999.99</sodBoChg>
            <sodPrList>text</sodPrList>
            <sodListPr>999.99</sodListPr>
            <discount>999.99</discount>
            <sodPrice>999.99</sodPrice>
            <desc1>text</desc1>
            <sodLoc>text</sodLoc>
            <sodSerial>text</sodSerial>
            <sodStdCost>999.99</sodStdCost>
            <sodCommPct>999.99</sodCommPct>
            <sodAcct>text</sodAcct>
            <sodSub>text</sodSub>
            <sodCc>text</sodCc>
            <sodProject>text</sodProject>
            <sodDscAcct>text</sodDscAcct>
            <sodDscSub>text</sodDscSub>
            <sodDscCc>text</sodDscCc>
            <sodDscProject>text</sodDscProject>
            <sodReqDate>2003-01-31</sodReqDate>
            <sodDueDate>2003-01-31</sodDueDate>
            <sodPerDate>2003-01-31</sodPerDate>
            <sodFixPr>true</sodFixPr>
            <sodType>text</sodType>
            <sodUmConv>999.99</sodUmConv>
            <sodOrderCategory>text</sodOrderCategory>
            <sodFrList>text</sodFrList>
            <sodTaxable>true</sodTaxable>
            <sodTaxc>text</sodTaxc>
            <sodcmmts>true</sodcmmts>
            <taxUsage>text</taxUsage>
            <taxEnv>text</taxEnv>
            <taxClass>text</taxClass>
            <taxTaxable>true</taxTaxable>
            <taxIn>true</taxIn>
            <sodPkgCode>text</sodPkgCode>
            <sodOrdMult>999.99</sodOrdMult>
            <sodChargeType>text</sodChargeType>
            <sodAltPkg>true</sodAltPkg>
            <pkgCodeAlt>text</pkgCodeAlt>
            <pkgCodeAlt>text</pkgCodeAlt>
            <pkgCodeAlt>text</pkgCodeAlt>
            <pkgCodeAlt>text</pkgCodeAlt>
            <pkgCodeAlt>text</pkgCodeAlt>
            <pkgCodeAlt>text</pkgCodeAlt>
            <pkgCodeAlt>text</pkgCodeAlt>
            <ordMultAlt>999.99</ordMultAlt>
            <ordMultAlt>999.99</ordMultAlt>
            <ordMultAlt>999.99</ordMultAlt>
            <ordMultAlt>999.99</ordMultAlt>
            <ordMultAlt>999.99</ordMultAlt>
            <ordMultAlt>999.99</ordMultAlt>
            <ordMultAlt>999.99</ordMultAlt>
            <chargeTypeAlt>text</chargeTypeAlt>
            <chargeTypeAlt>text</chargeTypeAlt>
            <chargeTypeAlt>text</chargeTypeAlt>
            <chargeTypeAlt>text</chargeTypeAlt>
            <chargeTypeAlt>text</chargeTypeAlt>
            <chargeTypeAlt>text</chargeTypeAlt>
            <chargeTypeAlt>text</chargeTypeAlt>
            <sodUpdIsb>true</sodUpdIsb>
            <sodAutoIns>true</sodAutoIns>
            <sodEnduser>text</sodEnduser>
            <sodIsbLoc>text</sodIsbLoc>
            <sodOwner>text</sodOwner>
            <sodSvCode>text</sodSvCode>
            <serial>text</serial>
            <part>text</part>
            <sodWarrStart>2003-01-31</sodWarrStart>
            <detclass>text</detclass>
            <detwt>999.99</detwt>
            <detwtum>text</detwtum>
            <additionalCharges>
              <operation>text</operation>
              <sodlcLcLine>999</sodlcLcLine>
              <sodlcTrlCode>text</sodlcTrlCode>
              <sodlcLcAmt>999.99</sodlcLcAmt>
              <sodlcOneTime>true</sodlcOneTime>
              <sodlcChargeType>text</sodlcChargeType>
              <sodlcRef>text</sodlcRef>
            </additionalCharges>
            <salesLineTransComment>
              <operation>text</operation>
              <cmtSeq>999</cmtSeq>
              <cdRef>text</cdRef>
              <cdType>text</cdType>
              <cdLang>text</cdLang>
              <cdSeq>999</cdSeq>
              <cmtCmmt>text</cmtCmmt>
              <cmtCmmt>text</cmtCmmt>
              <cmtCmmt>text</cmtCmmt>
              <cmtCmmt>text</cmtCmmt>
              <cmtCmmt>text</cmtCmmt>
              <cmtCmmt>text</cmtCmmt>
              <cmtCmmt>text</cmtCmmt>
              <cmtCmmt>text</cmtCmmt>
              <cmtCmmt>text</cmtCmmt>
              <cmtCmmt>text</cmtCmmt>
              <cmtCmmt>text</cmtCmmt>
              <cmtCmmt>text</cmtCmmt>
              <cmtCmmt>text</cmtCmmt>
              <cmtCmmt>text</cmtCmmt>
              <cmtCmmt>text</cmtCmmt>
              <prtOnQuote>true</prtOnQuote>
              <prtOnSo>true</prtOnSo>
              <prtOnInvoice>true</prtOnInvoice>
              <prtOnPacklist>true</prtOnPacklist>
              <prtOnPo>true</prtOnPo>
              <prtOnRct>true</prtOnRct>
              <prtOnRtv>true</prtOnRtv>
              <prtOnShpr>true</prtOnShpr>
              <prtOnBol>true</prtOnBol>
              <prtOnCus>true</prtOnCus>
              <prtOnProb>true</prtOnProb>
              <prtOnSchedule>true</prtOnSchedule>
              <prtOnIsrqst>true</prtOnIsrqst>
              <prtOnDo>true</prtOnDo>
              <prtOnIntern>true</prtOnIntern>
            </salesLineTransComment>
          </salesLine>
          <taxDetailRecord>
            <operation>text</operation>
            <taxLine>999</taxLine>
            <taxTrl>text</taxTrl>
            <tx2dTotamt>999.99</tx2dTotamt>
            <tx2dTottax>999.99</tx2dTottax>
            <tx2dCurTaxAmt>999.99</tx2dCurTaxAmt>
            <tx2dCurRecovAmt>999.99</tx2dCurRecovAmt>
          </taxDetailRecord>
          <importDetails>
            <operation>text</operation>
            <iedLine>999</iedLine>
            <iedIntrastat>true</iedIntrastat>
            <iedComCode>text</iedComCode>
            <iedTermsDeliv>text</iedTermsDeliv>
            <iedNatTrans>text</iedNatTrans>
            <iedCtryDesdisp>text</iedCtryDesdisp>
            <iedModeTransp>text</iedModeTransp>
            <iedCtryOrigin>text</iedCtryOrigin>
            <iedStatProc>text</iedStatProc>
            <iedPortArrdisp>text</iedPortArrdisp>
            <iedRegion>text</iedRegion>
            <iedPortTransh>text</iedPortTransh>
          </importDetails>
        </pendingInvoice>
      </dsPendingInvoice>
    </maintainPendingInvoice>
  </soapenv:Body>
</soapenv:Envelope>
